In [3]:
###第10章 数据聚合与分组运算
import pandas as pd
import numpy as np

In [4]:
df=pd.DataFrame({'key1':['a','a','b','d','d'],'key2':['one','two','one','two','one'],'data1':np.random.randn(5),'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.585018  0.780340
1    a  two  0.033574 -0.663611
2    b  one  1.833275  0.371402
3    d  two -0.809772  1.404659
4    d  one -1.172281 -0.678995

In [13]:
##分组求平均值
grouped1=df['data1'].groupby(df['key1']).mean()  ##注：mean()前的内容只是一个groupby对象，它实际上还没有进行任何计算。
print(grouped1)
grouped2=df['data2'].groupby(df['key2']).mean()
print(grouped2)
grouped3=df['data1'].groupby([df['key2'],df['key1']]).mean()  ###多个指标分组计算。
print(grouped3)
print(grouped3.unstack())

key1
a   -0.275722
b    1.833275
d   -0.991027
Name: data1, dtype: float64
key2
one    0.157582
two    0.370524
Name: data2, dtype: float64
key2  key1
one   a      -0.585018
      b       1.833275
      d      -1.172281
two   a       0.033574
      d      -0.809772
Name: data1, dtype: float64
key1         a         b         d
key2
one  -0.585018  1.833275 -1.172281
two   0.033574       NaN -0.809772

In [22]:
states=np.array(['Ohio','California','California','Ohio','Ohio'])
states
years=np.array([2005,2006,2005,2005,2006])
years
df['data1'].groupby([states,years]).mean()
print(df.groupby('key1').mean())
df.groupby(['key1','key2']).mean()
df.groupby(['key1','key2']).size()

         data1     data2
key1
a    -0.275722  0.058365
b     1.833275  0.371402
d    -0.991027  0.362832

key1  key2
a     one     1
      two     1
b     one     1
d     one     1
      two     1
dtype: int64

In [23]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.585018  0.780340
1    a  two  0.033574 -0.663611
b
  key1 key2     data1     data2
2    b  one  1.833275  0.371402
d
  key1 key2     data1     data2
3    d  two -0.809772  1.404659
4    d  one -1.172281 -0.678995

In [26]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1    data2
0    a  one -0.585018  0.78034
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.033574 -0.663611
('b', 'one')
  key1 key2     data1     data2
2    b  one  1.833275  0.371402
('d', 'one')
  key1 key2     data1     data2
4    d  one -1.172281 -0.678995
('d', 'two')
  key1 key2     data1     data2
3    d  two -0.809772  1.404659

In [29]:
pieces=dict(list(df.groupby('key1')))  ###讲数据片段作为一个字典
print(pieces)
pieces['b']

{'a':   key1 key2     data1     data2
0    a  one -0.585018  0.780340
1    a  two  0.033574 -0.663611, 'b':   key1 key2     data1     data2
2    b  one  1.833275  0.371402, 'd':   key1 key2     data1     data2
3    d  two -0.809772  1.404659
4    d  one -1.172281 -0.678995}

  key1 key2     data1     data2
2    b  one  1.833275  0.371402

In [35]:
####groupby默认是在axis=0上进行分组的，通过设置也可以在其他任何轴上进行分组。比如:我们可以根据dtype对列进行分组。
df.dtypes
grouped=df.groupby(df.dtypes,axis=1)
for dtype,group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.585018  0.780340
1  0.033574 -0.663611
2  1.833275  0.371402
3 -0.809772  1.404659
4 -1.172281 -0.678995
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    d  two
4    d  one

In [45]:
print(df)
df.groupby('key1')['data1'].mean()
df.groupby('key1')[['data2']].mean()
df.groupby(['key1','key2'])[['data2']].mean()

  key1 key2     data1     data2
0    a  one -0.585018  0.780340
1    a  two  0.033574 -0.663611
2    b  one  1.833275  0.371402
3    d  two -0.809772  1.404659
4    d  one -1.172281 -0.678995

              data2
key1 key2
a    one   0.780340
     two  -0.663611
b    one   0.371402
d    one  -0.678995
     two   1.404659

In [58]:
####通过字典或Series进行分组
people=pd.DataFrame(np.random.randn(5,5),columns=['a','b','c','d','e'],index=['hy','shd','tyy','hh','xx'])##numpy.random.randn(d0, d1, …, dn)是从标准正态分布中返回一个或多个样本值。 
people
##现在可以将下面的字典传给groupby，来构造数组
mapping={'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}
by_column=people.groupby(mapping,axis=1)
print(by_column.sum())
#for index,rows in people.iterrows():
   # print(rows['a'])
    
####通过函数进行分组：使用函数是一种更原生的方法定义分组映射。任何被当作分组键的函数都会在各个索引值上被调用一次，其返回值就会被当做分组名称。

         blue       red
hy   1.319440 -0.435684
shd  0.707828 -0.433910
tyy  0.650694 -0.149923
hh   0.551766  1.861718
xx  -0.261327 -1.183069

In [63]:
print(people)
people.groupby(len).sum()

            a         b         c         d         e
hy   0.710044 -0.413829  0.397644  0.921796 -0.731899
shd -0.010952 -0.009548  0.977015 -0.269187 -0.413409
tyy  1.043700 -0.281592  0.823735 -0.173041 -0.912032
hh  -0.602163  2.404890  0.119069  0.432696  0.058991
xx   0.331386 -1.436498 -0.955267  0.693940 -0.077957

          a         b         c         d         e
2  0.439267  0.554563 -0.438554  2.048432 -0.750865
3  1.032748 -0.291140  1.800750 -0.442228 -1.325441

In [71]:
###10.2数据聚合
#聚合指的是任何能够从数组产生标量值的数据转换过程。比如：count,sum,mean,median,std,var,prod....
#如果要使用自己的聚合函数，只需要引入aggregate或agg方法即可
df
grouped=df.groupby('key1').quantile(0.9)
grouped
grouped.describe()

0.9       data1     data2
count  3.000000  3.000000
mean   0.319655  0.734547
std    1.373119  0.421193
min   -0.846023  0.371402
25%   -0.437154  0.503673
50%   -0.028285  0.635945
75%    0.902495  0.916119
max    1.833275  1.196293

In [80]:
df
df['percentage']=df['data1']/df['data2']
df
grouped=df.groupby(['data1','data2'])['percentage'].agg(['mean','std'])   ###聚合
grouped

##下面的这个更为方便
function=['count','mean','max']  #定义一个函数
grouped1=df.groupby(['data1','data2'])['percentage'].agg(function) 
grouped2=df.groupby(['data1','data2'],as_index=False)['percentage'].agg(function)
grouped1
grouped2

                     count      mean       max
data1     data2
-1.172281 -0.678995      1  1.726494  1.726494
-0.809772  1.404659      1 -0.576490 -0.576490
-0.585018  0.780340      1 -0.749696 -0.749696
 0.033574 -0.663611      1 -0.050594 -0.050594
 1.833275  0.371402      1  4.936096  4.936096

In [84]:
###10.3apply：一般性的“拆分-应用-合并”
##假如你想选出最高的5个percentage值，首先，编写一个选取指定列具有最大值的行的函数
def top(df,n=2,column='percentage'):
    return df.sort_values(by=column)[-n:]

top(df,n=5)
df.groupby('key2').apply(top)

       key1 key2     data1     data2  percentage
key2
one  4    d  one -1.172281 -0.678995    1.726494
     2    b  one  1.833275  0.371402    4.936096
two  3    d  two -0.809772  1.404659   -0.576490
     1    a  two  0.033574 -0.663611   -0.050594

In [94]:
######重点：分位数和桶分析
##bucket和quantile
frame=pd.DataFrame({'data1':np.random.randn(1000),'data2':np.random.randn(1000)})
frame
quartiles=pd.cut(frame.data1,4)  ###分为4个区间
quartiles[:10]
#由cut返回的quartile对象可直接传递给groupby。
def get_stats(group):
    return {'min':group.min(),'max':group.max(),'mean':group.mean()}
data1=frame.data2.groupby(quartiles).apply(get_stats).unstack()  #########很好用诶，重点重点
data1

                       max      mean       min
data1
(-3.336, -1.753]  2.572873 -0.047038 -2.159787
(-1.753, -0.176]  3.177792  0.108653 -2.699609
(-0.176, 1.401]   2.757020  0.018649 -2.707096
(1.401, 2.978]    3.034390 -0.162252 -3.113636

In [99]:
#######对于缺失数据的清理工作，有时你会用dropna将其替换掉，而有时则可能希望用一个固定值或由数据集本身所衍生出来的值去填充NA值。
#####这时就得用fillna这个工具了
##下面我们用平均值去填充NA值
s=pd.Series(np.random.randn(6))
s[::2]=np.nan
s.fillna(s.mean())

0   -0.945872
1   -1.685602
2   -0.945872
3   -1.452244
4   -0.945872
5    0.300229
dtype: float64

In [103]:
#######10.4透视表和交叉表(pivot table)  其是根据一个键或者多个键对数据进行聚合，并根据行和列上的分组键将数据分配到各个矩形区域中。
#####DF中有一个pivot_table方法，此外还有一个顶级的pandas.pivot_table函数。
print(df)
print(df.groupby(['key1','key2']).mean())
print(df.pivot_table(index=['key1','key2']))   #从这里可以看出来groupby和pivot table是达到一个目的的两条路而已

  key1 key2     data1     data2  percentage
0    a  one -0.585018  0.780340   -0.749696
1    a  two  0.033574 -0.663611   -0.050594
2    b  one  1.833275  0.371402    4.936096
3    d  two -0.809772  1.404659   -0.576490
4    d  one -1.172281 -0.678995    1.726494
              data1     data2  percentage
key1 key2
a    one  -0.585018  0.780340   -0.749696
     two   0.033574 -0.663611   -0.050594
b    one   1.833275  0.371402    4.936096
d    one  -1.172281 -0.678995    1.726494
     two  -0.809772  1.404659   -0.576490
              data1     data2  percentage
key1 key2
a    one  -0.585018  0.780340   -0.749696
     two   0.033574 -0.663611   -0.050594
b    one   1.833275  0.371402    4.936096
d    one  -1.172281 -0.678995    1.726494
     two  -0.809772  1.404659   -0.576490